from time import sleep

from aiogram.filters import CommandStart, callback_data
from aiogram.types import Message, CallbackQuery
from aiogram import Router, F
import buttons as kb


router = Router()

@router.message(CommandStart())
async def start(message: Message):
    await message.answer(
        "<b>Привет, друг!</b>\n"
        "Рад приветствовать тебя в <b>GeographyLearn</b>!🌍\n"
        "Этот бот поможет тебе лучше разбираться в географической терминологии "
        "и научит работать с формулами❄️",
        parse_mode="HTML"
    ),
    await message.answer("Какую хочешь выбрать тему:", reply_markup=kb.start_button)


### Река
@router.callback_query(F.data == "river")
async def river(callback: CallbackQuery):
    await callback.answer()
    await callback.message.edit_text("Что хотите узнать?🤔", reply_markup=kb.river_button)

@router.callback_query(F.data == "beg_end")
async def beg_end(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://avatars.mds.yandex.net/get-shedevrum/16293477/img_dd6c6a9e477611f0beec421a7b1dd356/orig")
    await callback.message.answer("""Исток 🏔
Исток — это место, где река берёт своё начало.

Источники питания истока могут быть разными:

родник (подземный источник) 💧;

озеро 🏞️;

болото 🌫;

тающий ледник ❄️;

слияние двух малых рек или ручьёв 🔗.

Важные особенности:

Исток всегда расположен выше устья (поскольку вода течёт под действием силы тяжести — сверху вниз) ↘️.

На картах исток обычно обозначается точкой или небольшим кружком 🔍.

В горных районах исток часто находится на большой высоте 🏔.
""")
    await callback.message.answer("""Устье 🏖️
Устье — это место, где река впадает в другой водоём:

в другую реку (тогда она становится её притоком) 🔄;

в озеро 🏞️;

в море 🌊;

в океан 🌎.

Важные особенности:

В устье река прекращает своё самостоятельное течение ⛔.

Часто в устье образуется дельта — район, где русло разветвляется на множество рукавов и протоков (например, дельты Нила, Волги, Миссисипи) 🌾.

Иногда устье имеет форму широкого воронкообразного залива — такой тип называется эстуарий (например, устье Темзы, Енисея) 🎯.""")
    sleep(5)
    await callback.message.answer("Классно🤩, вы узнали что-то новое?\n" +
                                  "Что на этот раз хотите посмотреть:", reply_markup=kb.river_button)



@router.callback_query(F.data == "river_regime")
async def river_regime(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://o.quizlet.com/KHr0BHyIY3c66z-5RohvKA.jpg")
    await callback.message.answer("""Режим реки — это закономерное изменение её состояния (уровня воды, скорости течения, температуры) во времени ⏳. В основе режима — климатические условия, рельеф, тип питания и влияние человека.
    
    В годовом цикле выделяют три главные фазы:
    
I Половодье 🌧️

Что это: длительный и устойчивый подъём уровня воды.

Когда бывает: ежегодно в определённый сезон (чаще весной).

Причины: таяние снега на равнинах (весеннее половодье) или ледников в горах (летнее половодье).

Особенности: часто сопровождается разливом на пойму.

Пример: на Русской равнине — весеннее половодье; на Амуре — летом или осенью.


II Межень 🏜️

Что это: период самого низкого уровня воды.

Когда бывает:

летняя межень — если снег тает весной, а летних осадков мало;

зимняя межень — при устойчивых минусовых температурах.

Причины: питание в основном за счёт подземных вод.

Особенности: реки мелеют, в засушливых районах могут пересыхать.


III Паводок ⛈️

Что это: быстрый и кратковременный подъём уровня воды.

Когда бывает: нерегулярно, чаще летом и осенью.

Причины: ливневые дожди или зимние оттепели.

Особенности: может вызывать наводнения, особенно в предгорьях.""")
    sleep(5)
    await callback.message.answer("Классно🤩, вы узнали что-то новое?\n" +
                                  "Что на этот раз хотите посмотреть:", reply_markup=kb.river_button)


@router.callback_query(F.data == "river_feed")
async def river_feed(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://avatars.mds.yandex.net/i?id=4c34c4e72640c566b1de47ec45c0e159_l-6966967-images-thumbs&n=13")
    await callback.message.answer("""Питание реки — это источники поступления воды в русло. У одной реки может быть несколько источников питания 🔄.
    
    🌧️ 4 основных типа питания:
    
    I Дождевое

Источник: атмосферные осадки.

Где: экваториальные и тропические широты, юг умеренных широт.

Примеры: Амазонка, Нил, Конго.

    II Снеговое ❄️

Источник: таяние зимнего снежного покрова.

Где: север умеренных и приполярные широты.

Примеры: Обь, Енисей, Маккензи.

    III Подземное (грунтовое) 💧

Источник: грунтовые воды.

Где: особенно важно в засушливых тропических областях.

Особенность: поддерживает уровень воды в межень.

    IV Ледниковое ⛰️

Источник: таяние высокогорных ледников и снежников.

Где: горные реки.

Пример: реки Кавказа, Алтая.""")
    sleep(5)
    await callback.message.answer("Классно🤩, вы узнали что-то новое?\n" +
                                  "Что на этот раз хотите посмотреть:", reply_markup=kb.river_button)

@router.callback_query(F.data == "flows")
async def flows(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://avatars.mds.yandex.net/i?id=ed793f0b01e92b4536c7489ddff67dd452a947d2-4566480-images-thumbs&n=13")
    await callback.message.answer("""По условиям протекания реки делят на три основных типа 🗺️:
    
    I Равнинные реки 🏞️

Течение: медленное, плавное 🐢.

Рельеф: текут по широким равнинам 🌾.

Уклоны и скорость: малые ↘️.

Русло: извилистое, образует зигзаги и широкую долину; обычно сложено песком и илом 🔄.

Особенности:

пригодны для судоходства ⛴;

хороши для рыбалки 🎣;

вода теплее ☀️.

Примеры: Дон, Волга, Ока, Енисей (нижнее течение), Амазонка, Сена.

    II Горные реки ⛰️

Течение: быстрое, бурное 🌪.

Рельеф: протекают по узким глубоким долинам и ущельям 🪨.

Уклоны и скорость: большие ↗️.

Русло: каменистое, часто с порогами и водопадами 💧⛰️.

Особенности:

вода холодная ❄️;

многие начинаются в горах, затем спускаются на равнину ↘️;

живописные пейзажи 🌄.

Примеры: Колорадо, Терек, Мбому, Меконг (верхнее течение).

    III Полугорные реки 🏔

Течение: промежуточное между горной и равнинной рекой 🚶‍♂️.

Рельеф: переходная зона (предгорье) 🛣️.

Русло: может быть сложено крупным песком, гравием, галькой 🪨.

Особенности: сочетают черты горных и равнинных рек 🔄.

Пример: Риони (Грузия).

""")
    sleep(5)
    await callback.message.answer("Классно🤩, вы узнали что-то новое?\n" +
                                  "Что на этот раз хотите посмотреть:", reply_markup=kb.river_button)

@router.callback_query(F.data == "Back")
async def back(callback: CallbackQuery):
    await callback.message.edit_text("Какую хочешь выбрать тему:", reply_markup=kb.start_button)


### Часовой пояс
@router.callback_query(F.data == "Hours")
async def hours(callback: CallbackQuery):
    await callback.message.edit_text("Выберите подтему:", reply_markup=kb.Hours_button)

@router.callback_query(F.data == "Whatis")
async def whatis(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/World_Time_Zones_Map.png/1920px-World_Time_Zones_Map.png")
    await callback.message.answer("""🕧 Часовые пояса:
Часовой пояс — это область земной поверхности, где используется единое стандартное время ⏱️.

Зачем нужны часовые пояса?
Чтобы согласовать время между регионами 🌍.

Для удобства транспорта и связи (поезда, самолёты, телеграф) ⛴.

Для синхронизации работы бизнеса и госучреждений 🏢.""")
    await callback.message.answer("""Основа: UTC и Гринвичский меридиан.

24 основных пояса, всего ~37 (есть дробные).

В России 11 поясов, отсчёт от Москвы (UTC+3).

Нужны для транспорта, связи и глобальной координации.""")
    sleep(5)
    await callback.message.answer("Что хотите узнать?🤔", reply_markup=kb.start_button)


@router.callback_query(F.data == "formula")
async def formula(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://avatars.mds.yandex.net/i?id=61960faf069513e1352bf50004ff1d47201ae535-4120244-images-thumbs&n=13")
    await callback.message.answer("""Как узнать разницу часовых поясов?
<i>Разница во времени = Номер часового пояса города 2 − Номер часового пояса города 1</i>
    
    «+» — если город 2 восточнее.➡️

    «−» — если город 2 западнее.⬅️""", parse_mode="HTML" )
    await callback.message.answer("""В Санкт‑Петербурге 14:00 (UTC + 3). Какой час в Дубае (UTC + 4)?

1) Разница поясов: 4 − 3 = 1 час.

2) Дубай восточнее → прибавляем: 14:00 + 1:00 = 15:00.
Ответ: в Дубае 15:00.""")
    await callback.message.answer("Что хотите узнать?🤔", reply_markup=kb.start_button)

@router.callback_query(F.data == "ver_obj")
async def ver_obj(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://avatars.mds.yandex.net/i?id=9b0af93739482ac1d1b9f99cb78333e3_l-5517488-images-thumbs&n=13")
    await callback.message.answer("""🌊 Виды водных объектов

Водные объекты бывают:

    I Поверхностные (на земле):

моря, заливы, проливы 🌅;

реки и ручьи 🏞️;

озёра, пруды, водохранилища 🏝️;

болота 🪸;

родники и гейзеры 🔮;

ледники ❄️.

    II Подземные (под землёй):

бассейны подземных вод 🕳️;

водоносные горизонты (грунтовые и артезианские).


По наличию воды:

постоянные (реки, океаны);

временные (пересыхающие ручьи, озёра).""")
    sleep(5)
    await callback.message.answer("Что хотите узнать?🤔", reply_markup=kb.start_button)

@router.callback_query(F.data == "climatic_zone")
async def clim_zone(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://cdn-user84060.skyeng.ru/uploads/664c954e95f81249003646-67b9aae699abf235644295.webp")
    await callback.message.answer("""Основные пояса:

I Экваториальнй — жарко и влажно 🌡️.

II Тропический — жарко и сухо ☀️.

III Умеренный — 4 сезона 🌤️.

IV Полярный — холодно и снежно ❄️.""")
    await callback.message.answer("""Переходные пояса:

I Субэкваториальный — дожди летом, сухо зимой 🌴.

II Субтропический — жаркое лето, мягкая зима 🌴☀️.

III Субполярный — короткое прохладное лето, долгая холодная зима 🥶.""")
    sleep(5)
    await callback.message.answer("Что хотите узнать?🤔", reply_markup=kb.start_button)

@router.callback_query(F.data == "geochronology")
async def geochrono(callback: CallbackQuery):
    await callback.message.answer_photo(photo="https://umschool.net/library/wp-content/uploads/2023/02/1-26-edited.png")
    await callback.message.answer(("""🌍 Геохронология: просто о сложном
Геохронология — наука, которая определяет возраст горных пород, минералов и событий в истории Земли. Она помогает выстроить хронологию геологических процессов и эволюции жизни.

    1)🔎 Два типа возраста в геохронологии
Относительный возраст — показывает, какие породы старше, а какие моложе, но не даёт точного количества лет.

    2)Абсолютный возраст — указывает возраст в годах (обычно в миллионах или тысячах лет)."""))
    await callback.message.answer("""🌋 Архей — 4000–2500 млн лет назад.
🌊 Протерозой — 2500–541 млн лет назад.
🦞 Палеозой — 541–252 млн лет назад.
🦕 Мезозой — 252–66 млн лет назад.
🦍 Кайнозой — 66 млн лет назад — настоящее время.

Архей → 2. Протерозой → 3. Палеозой → 4. Мезозой → 5. Кайнозой""")
    sleep(5)
    await callback.message.answer("Что хотите узнать?🤔", reply_markup=kb.start_button)